STMicroelectronics/STM32CubeH7RS/Utilities/GUI_INTERFACE/gui_api.c
#if defined(_SNK) || defined(_DRP)
#define GUI_UPDATE_VOLTAGE_MIN(_PDO_VOLT_, _SNK_VOLT_) \
  if ((_PDO_VOLT_) < (_SNK_VOLT_)) \
  { \
    /* Update min voltage */ \
    (_SNK_VOLT_) = (_PDO_VOLT_); \
  }
#define GUI_UPDATE_VOLTAGE_MAX(_PDO_VOLT_, _SNK_VOLT_) \
  if ((_PDO_VOLT_) > (_SNK_VOLT_)) \
  { \
    /* Update min voltage */ \
    (_SNK_VOLT_) = (_PDO_VOLT_); \
  }
#define GUI_UPDATE_CURRENT_MAX(_PDO_CURRENT_, _SNK_CURRENT_) \
  if ((_PDO_CURRENT_) > (_SNK_CURRENT_)) \
  { \
    /* Update min current */ \
    (_SNK_CURRENT_) = (_PDO_CURRENT_); \
  }
#define GUI_UPDATE_POWER_MAX(_PDO_POWER_, _SNK_POWER_) \
  if ((_PDO_POWER_) > (_SNK_POWER_)) \
  { \
    /* Update min POWER */ \
    (_SNK_POWER_) = (_PDO_POWER_); \
  }
#define GUI_CHECK_VOLTAGE_MIN(_PDO_VOLT_, _SNK_VOLT_) \
  /* Update min voltage */ \
  (_SNK_VOLT_) = (_PDO_VOLT_);
#define GUI_CHECK_VOLTAGE_MAX(_PDO_VOLT_, _SNK_VOLT_) \
  /* Update min voltage */ \
  (_SNK_VOLT_) = (_PDO_VOLT_);
#define GUI_CHECK_CURRENT_MAX(_PDO_CURRENT_, _SNK_CURRENT_) \
  /* Update min current */ \
  (_SNK_CURRENT_) = (_PDO_CURRENT_);
#define GUI_CHECK_POWER_MAX(_PDO_POWER_, _SNK_POWER_) \
  /* Update min POWER */ \
  (_SNK_POWER_) = (_PDO_POWER_);

#define GUI_DECODE_50MV(_Value_)           ((uint16_t)(((_Value_) * 50U)))     /* From 50mV multiples to mV     */
#define GUI_DECODE_100MV(_Value_)          ((uint16_t)(((_Value_) * 100U)))    /* From 100mV multiples to mV    */
#define GUI_DECODE_10MA(_Value_)           ((uint16_t)(((_Value_) * 10U)))     /* From 10mA multiples to mA     */
#define GUI_DECODE_50MA(_Value_)           ((uint16_t)(((_Value_) * 50U)))     /* From 50mA multiples to mA     */
#define GUI_DECODE_MW(_Value_)             ((uint16_t)(((_Value_) * 250U)))    /* From 250mW multiples to mW    */
#endif /* _SNK) || _DRP */

/**
  * @}
  */

/* Private function prototypes -----------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/** @defgroup USBPD_GUI_API_Private_Variables USBPD GUI API Private Variables
  * @{
  */
/*!< Timer used to send measurement report*/
__IO uint16_t GUI_TimerMeasReport[USBPD_PORT_COUNT];

extern USBPD_SettingsTypeDef DPM_Settings[USBPD_PORT_COUNT];
#ifdef _VDM
extern USBPD_VDM_SettingsTypeDef  DPM_VDM_Settings[USBPD_PORT_COUNT];
#endif /* _VDM */
GUI_USER_ParamsTypeDef GUI_USER_Params[USBPD_PORT_COUNT];

uint8_t PtrDataRx[TLV_SIZE_MAX];
uint8_t Processed[TLV_SIZE_MAX];

USBPD_GUI_State GUI_State = GUI_STATE_INIT;
/*!< Flag to indicate that user settings is from original FW (not saved into the FLASH) */
uint8_t GUI_OriginalSettings;

#if defined(_RTOS) || defined(USBPD_THREADX)
GUIOS_QUEUE_ID  GUIMsgBox;
GUIOS_TASK_ID GUI_ThreadID;
#else
__IO uint32_t GUI_Flag = GUI_USER_EVENT_NONE;
#endif /* _RTOS || USBPD_THREADX */

const uint8_t *(*pCB_HWBoardVersion)(void)  = NULL;
const uint8_t *(*pCB_HWPDType)(void)        = NULL;
uint16_t (*pCB_GetVoltage)(uint8_t)         = NULL;
int16_t (*pCB_GetCurrent)(uint8_t)         = NULL;
USBPD_StatusTypeDef(*pCB_FreeText)(uint8_t, uint8_t *, uint16_t) = NULL;

GUI_HandleTypeDef GUI_SaveInformation[USBPD_PORT_COUNT];

/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/
/** @defgroup USBPD_GUI_API_Private_Functions GUI API Private Functions
  * @{
  */
#if defined(_RTOS) || defined(USBPD_THREADX)
GUIDEF_TASK_FUNCTION(TaskGUI);
static uint32_t  CheckGUITimers(void);
#endif /* _RTOS || USBPD_THREADX */

static void      GUI_CALLBACK_RX(uint8_t Character, uint8_t Error);
static void      Send_DpmInitCnf(uint8_t PortNum, uint8_t *string);
static void      Request_MessageReq(uint8_t PortNum, uint8_t *instruction, uint8_t *pEncodedMsg);
static void      Send_DpmConfigSetCnf(uint8_t PortNum, uint8_t *instruction, uint8_t *pEncodedMsg);
static void      Send_DpmConfigGetCnf(uint8_t PortNum, uint8_t *instruction, uint8_t *pEncodedMsg);
static void      Send_DpmConfigGetRej(uint8_t PortNum, uint8_t *pEncodedMsg, USBPD_GUI_Reject_Reason RejecReason);
static void      Send_DpmMessageRej(uint8_t PortNum, uint8_t *pEncodedMsg, USBPD_GUI_Reject_Reason RejecReason);
static void      Send_DpmRegisterReadCnf(uint8_t PortNum, uint8_t *string, uint8_t param);
static void      Send_DpmRegisterWriteCnf(uint8_t PortNum, uint8_t *string, uint8_t *toProcess);
static USBPD_StatusTypeDef Manage_FreeText(uint8_t PortNum, uint8_t *pPayload, uint16_t Size);
#if defined(_SNK) || defined(_DRP)
static void      UpdateSNKPowerPort0(void);
#if USBPD_PORT_COUNT==2
static void      UpdateSNKPowerPort1(void);
#endif /* USBPD_PORT_COUNT==2 */
#endif /* _SNK) || _DRP */
#if defined(USE_STM32_UTILITY_OS)
void                  GUI_Execute(void);
#endif /* USE_STM32_UTILITY_OS */

/**
  * @}
  */

/* Exported functions ------------------------------------------------------- */
/** @addtogroup USBPD_GUI_API_Exported_Functions
  * @{
  */

/**
  * @brief  GUI initialization function
  * @param  CB_HWBoardVersion BSP callback to retrieve HW Board version
  * @param  CB_HWPDType       BSP callback to retrieve HW PD Type
  * @param  CB_GetVoltage     BSP callback to retrieve VBUS voltage
  * @param  CB_GetCurrent     BSP callback to retrieve IBUS current
  * @retval Functional state
  */
USBPD_FunctionalState GUI_Init(const uint8_t *(*CB_HWBoardVersion)(void), const uint8_t *(*CB_HWPDType)(void),
                               uint16_t (*CB_GetVoltage)(uint8_t), int16_t (*CB_GetCurrent)(uint8_t))
{
  USBPD_FunctionalState _status = USBPD_ENABLE;
  /* Retrieve data from FLASH if needed */
  GUI_OriginalSettings = ((GUI_OK == BSP_GUI_LoadDataFromFlash()) ? USBPD_FALSE : USBPD_TRUE);

  /* Need to update CAD_tDRP & CAD_dcSRC_DRP if CAD_SNKToggleTime not initialized */
  if ((0U == DPM_Settings[USBPD_PORT_0].CAD_SNKToggleTime) || (0U == DPM_Settings[USBPD_PORT_0].CAD_SRCToggleTime))
  {
    DPM_USER_Settings[USBPD_PORT_0].CAD_tDRP      = 80U;
    DPM_USER_Settings[USBPD_PORT_0].CAD_dcSRC_DRP = 50U;
  }
  else
  {
    DPM_USER_Settings[USBPD_PORT_0].CAD_dcSRC_DRP = (DPM_Settings[USBPD_PORT_0].CAD_SRCToggleTime * 100U) /
                                                    (DPM_Settings[USBPD_PORT_0].CAD_SRCToggleTime +
                                                     DPM_Settings[USBPD_PORT_0].CAD_SNKToggleTime);
    DPM_USER_Settings[USBPD_PORT_0].CAD_tDRP = (DPM_Settings[USBPD_PORT_0].CAD_SRCToggleTime * 100U) /
                                               DPM_USER_Settings[USBPD_PORT_0].CAD_dcSRC_DRP;
  }
#if USBPD_PORT_COUNT==2
  if ((0U == DPM_Settings[USBPD_PORT_1].CAD_SNKToggleTime) || (0U == DPM_Settings[USBPD_PORT_1].CAD_SRCToggleTime))
  {
    DPM_USER_Settings[USBPD_PORT_1].CAD_tDRP      = 80U;
    DPM_USER_Settings[USBPD_PORT_1].CAD_dcSRC_DRP = 50U;
  }
  else
  {
    DPM_USER_Settings[USBPD_PORT_1].CAD_dcSRC_DRP = (DPM_Settings[USBPD_PORT_1].CAD_SRCToggleTime * 100U) /
                                                    (DPM_Settings[USBPD_PORT_1].CAD_SRCToggleTime +
                                                     DPM_Settings[USBPD_PORT_1].CAD_SNKToggleTime);
    DPM_USER_Settings[USBPD_PORT_1].CAD_tDRP = (DPM_Settings[USBPD_PORT_1].CAD_SRCToggleTime * 100U) /
                                               DPM_USER_Settings[USBPD_PORT_1].CAD_dcSRC_DRP;
  }
#endif /* USBPD_PORT_COUNT==2 */


  pCB_HWBoardVersion  = CB_HWBoardVersion;
  pCB_HWPDType        = CB_HWPDType;
  pCB_GetVoltage      = CB_GetVoltage;
  pCB_GetCurrent      = CB_GetCurrent;

  /* Register 2 callbacks for notification in DPM */
  USBPD_DPM_SetNotification_GUI(GUI_FormatAndSendNotification, GUI_PostNotificationMessage, GUI_SaveInfo);

#if !defined(USBPD_THREADX)
  _status = (USBPD_FunctionalState) GUI_InitOS(NULL);
#endif /* !USBPD_THREADX */
  return _status;
}

/**
  * @brief  GUI threads initialization function
  * @param  MemoryPtr  Memory pointer
  * @retval Functional state
  */
uint32_t GUI_InitOS(void *MemoryPtr)
{
  static uint8_t _init = 0U;
  GUIOS_INIT();

  /* This init check to keep the compatibility with the previous version of the GUI */
  /* Only threadX required to separate the OS object init with the init code.       */
  if (_init == 0U)
  {
    _init = 1U;
#if defined(_RTOS) || defined(USBPD_THREADX)
    GUIOS_CREATE_QUEUE(GUIMsgBox, "GUIBOX", GUI_BOX_MESSAGES_MAX, GUIOS_ELEMENT_SIZE);
    GUIOS_CREATE_TASK(GUI_ThreadID, GUI, TaskGUI, OS_GUI_PRIORITY, OS_GUI_STACK_SIZE, &GUIMsgBox);
#else
    GUI_Start();
#if defined(USE_STM32_UTILITY_OS)
    UTIL_SEQ_RegTask(TASK_GUI, 0U, GUI_Execute);
    UTIL_SEQ_SetTask(TASK_GUI, 0U);
#endif /* USE_STM32_UTILITY_OS */
#endif /* _RTOS || USBPD_THREADX */
  }

#if defined(_RTOS) || defined(USBPD_THREADX)
error:
  return (_status);
#else
  return (USBPD_ENABLE);
#endif /* _RTOS || USBPD_THREADX */
}

/**
  * @brief  GUI reset by erasing data in flash
  * @retval None
  */
void GUI_Reset(void)
{
  /* Erase all saved data in flash */
  BSP_GUI_EraseDataInFlash();
}

/**
  * @brief  GUI start reception
  * @retval None
  */
void GUI_Start(void)
{
  /* Register the GUI callback to manage UART reception */
  TRACER_EMB_StartRX(GUI_CALLBACK_RX);
}

/**
  * @brief  GUI Task
  * @param  pEvent  GUI User event
  * @retval None
  */
#if defined(_RTOS) || defined(USBPD_THREADX)
GUIDEF_TASK_FUNCTION(TaskGUI)
#else
void GUI_Execute(void)
#endif /* _RTOS || USBPD_THREADX */
{
#if defined(_RTOS) || defined(USBPD_THREADX)
  uint32_t _timing = GUI_DEFAULT_WAIT;
  GUI_Start();
  do
  {
    GUIOS_QUEUE_EVENT event = 0U;
    GUIOS_GETMESSAGE_QUEUE(GUIMsgBox, _timing, event);
    switch ((GUI_USER_EVENT)(event & 0xFU))
    {
      case GUI_USER_EVENT_GUI:
      {
        (void)GUI_RXProcess((uint32_t)event);
        /* Sent an event to check if measurement report has been requested */
        GUIOS_PUT_MESSAGE_QUEUE(GUIMsgBox, GUI_USER_EVENT_TIMER, 0U);
        break;
      }
      case GUI_USER_EVENT_TIMER:
      {
#endif /* _RTOS || USBPD_THREADX */
#if !(defined(_RTOS) || defined(USBPD_THREADX))
        switch (GUI_Flag & 0xF)
        {
          case GUI_USER_EVENT_NONE:
            break;
          case GUI_USER_EVENT_GUI:
            GUI_RXProcess(GUI_Flag);
          case GUI_USER_EVENT_TIMER:
            break;
          default:
            break;
        }
        GUI_Flag = GUI_USER_EVENT_NONE;
#endif /* _RTOS || USBPD_THREADX */
        for (uint8_t _instance = 0U; _instance < (uint8_t)USBPD_PORT_COUNT; _instance++)
        {
          /* -------------------------------------------------  */
          /* Check if timeout related to Measurement reporting  */
          /* -------------------------------------------------  */
          /* - Send a GUI Event only if PE is connected
             and Measurement report has been enabled          */
          if ((USBPD_TRUE == DPM_Params[_instance].PE_IsConnected)
              && (1U == GUI_USER_Params[_instance].u.d.MeasReportActivation)
              && (0U != GUI_USER_Params[_instance].u.d.MeasReportValue))
          {
            /* Check if timer has expired */
            if (IS_GUI_TIMER_EXPIRED(_instance, GUI_TimerMeasReport))
            {
              uint32_t event_mr = GUI_USER_EVENT_GUI
                                  | (_instance << GUI_PE_PORT_NUM_POS)
                                  | (GUI_NOTIF_MEASUREMENT << GUI_PE_NOTIF_POS);
              (void)GUI_RXProcess(event_mr);
            }
            /* Start or Restart Measurement report timer */
            if (!(IS_GUI_TIMER_RUNNING(_instance, GUI_TimerMeasReport)))
            {
              GUI_START_TIMER(_instance, GUI_TimerMeasReport,
                              (uint16_t)(GUI_USER_Params[_instance].u.d.MeasReportValue) * GUI_NOTIF_MEASUREMENT_STEP);
            }
          }
          else
          {
            /* Stop measurement report timer */
            GUI_TimerMeasReport[_instance] = 0U;
          }
        }
#if defined(_RTOS) || defined(USBPD_THREADX)
        break;
      }

      default:
        break;
    }
    _timing = CheckGUITimers();
  } while (1 == 1);
#endif /* _RTOS || USBPD_THREADX */
}

#if defined(_RTOS) || defined(USBPD_THREADX)
/**
  * @brief  Calculate minimum timers to wake-up GUI task
  * @retval Timing
  */
static uint32_t CheckGUITimers(void)
{
  uint32_t _timing = GUI_DEFAULT_WAIT;
  uint32_t _current_timing;

  /* Calculate the minimum timers to wake-up GUI task */
  for (uint8_t instance = 0; instance < (uint8_t)USBPD_PORT_COUNT; instance++)
  {
    /* Check if Measurement reporting has been enabled by the GUI */
    _current_timing = (uint32_t)(GUI_TimerMeasReport[instance]) & GUI_TIMER_READ_MSK;
    if (_current_timing > 0U)
    {
      if (_current_timing < _timing)
      {
        _timing = _current_timing;
      }
    }
  }
  return _timing;
}
#endif /* RTOS || USBPD_THREADX */

/**
  * @brief  Increment GUI timer counter
  * @retval None
  */
void GUI_TimerCounter(void)
{
  /* Increment GUI timer only if Measurement report has been activated */
  if (1U == GUI_USER_Params[USBPD_PORT_0].u.d.MeasReportActivation)
  {
    if ((GUI_TimerMeasReport[USBPD_PORT_0] & GUI_TIMER_READ_MSK) > 0U)
    {
      GUI_TimerMeasReport[USBPD_PORT_0]--;
    }
#if !(defined(_RTOS) || defined(USBPD_THREADX)) && defined(USE_STM32_UTILITY_OS)
    else
    {
      UTIL_SEQ_SetTask(TASK_GUI, 0);
    }
#endif /* !(_RTOS || USBPD_THREADX) && USE_STM32_UTILITY_OS) */
  }
#if USBPD_PORT_COUNT==2
  if (1 == GUI_USER_Params[USBPD_PORT_1].u.d.MeasReportActivation)
  {
    if ((GUI_TimerMeasReport[USBPD_PORT_1] & GUI_TIMER_READ_MSK) > 0U)
    {
      GUI_TimerMeasReport[USBPD_PORT_1]--;
    }
#if !(defined(_RTOS) || defined(USBPD_THREADX)) && defined(USE_STM32_UTILITY_OS)
    else
    {
      UTIL_SEQ_SetTask(TASK_GUI, 0);
    }
#endif /* !(_RTOS || USBPD_THREADX) && USE_STM32_UTILITY_OS) */
  }
#endif /* USBPD_PORT_COUNT == 2 */
}

/**
  * @brief  Callback called to end a transfer
  * @param  Character Byte received by the device
  * @param  Error     Error detected in the reception
  * @retval None
  */
void GUI_CALLBACK_RX(uint8_t Character, uint8_t Error)
{
  uint32_t event;
  __disable_irq();
  event = GUI_GetMessage(Character, Error);
  __enable_irq();
  if (event == 1U)
  {
#if defined(_RTOS) || defined(USBPD_THREADX)
    GUIOS_PUT_MESSAGE_QUEUE(GUIMsgBox, GUI_USER_EVENT_GUI, 0U);
#else
    GUI_Flag = GUI_USER_EVENT_GUI;
#if defined(USE_STM32_UTILITY_OS)
    GUI_RXProcess(GUI_Flag);
    GUI_Flag = GUI_USER_EVENT_NONE;
#endif /* USE_STM32_UTILITY_OS */
#endif /* _RTOS */
  }
}

/**
  * @brief  Main Trace RX process to push data on the media.
  * @param  Event   GUI trace event
  * @retval Timing
  */
uint32_t GUI_RXProcess(uint32_t Event)
{
  uint8_t *msg;
  USBPD_GUI_State state;
  uint8_t size;

  if (0U == (Event & GUI_PE_NOTIF_MSK))
  {
    /* Message have been received by GUI */
    state = GUI_SendAnswer(&msg, &size);

    switch (state)
    {
      case GUI_STATE_RESET:
        /* DPM_RESET_REQ received by the device */
        /* Save parameters in FLASH */
        (void)BSP_GUI_SaveDataInFlash();
        HAL_NVIC_SystemReset();
        break;
      case GUI_STATE_INIT:
        /* DPM_INIT_REQ received by the device */
        break;
      default:
        /* Another GUI messages received by the device */
        TRACER_EMB_Add(msg, size);
        break;
    }
  }
  else
  {
    uint16_t type_event = ((uint16_t)Event & GUI_PE_NOTIF_MSK) >> GUI_PE_NOTIF_POS;
    if (GUI_NOTIF_MEASUREMENT == type_event)
    {
      /* Notification related to timeout for measure reporting */
      /* Send a notification to associated port */
      (void)GUI_FormatAndSendNotification(((Event & GUI_PE_PORT_NUM_MSK) >> GUI_PE_PORT_NUM_POS),
                                          GUI_NOTIF_MEASUREREPORTING,
                                          HAL_GetTick());
    }
    else
    {
      /* Message have been received by PE */
      /* Send a notification to associated port */
      (void)GUI_FormatAndSendNotification(((Event & GUI_PE_PORT_NUM_MSK) >> GUI_PE_PORT_NUM_POS),
                                          GUI_NOTIF_PE_EVENT,
                                          type_event);
    }
  }
  return 0;
}

/**
  * @brief  TRACE function to send a notification
  * @param  PortNum           Index of current used port
  * @param  TypeNotification  Type of requested notification is a combination
  *                           of @ref USBPD_TRACE_TRACE_TYPE_NOTIFICATION
  * @param  Value             Value depending of TypeNotification
  * @note   If TypeNotification == GUI_NOTIF_ISCONNECTED, Value should be equal to 0 (Not connected) or 1 (connected)
  * @retval USBPD Status
  */
uint32_t GUI_FormatAndSendNotification(uint32_t PortNum, uint32_t TypeNotification, uint32_t Value)
{
  uint8_t *msg;
  uint8_t size;
  /* Only send notification if GUI is connected */
  if (GUI_STATE_INIT != GUI_SendNotification((uint8_t)PortNum, &msg, &size, TypeNotification, Value))
  {
    TRACER_EMB_Add(msg, size);
  }
  return 0;
}


/**
  * @brief  Function called through UART IT RX to fill the GUI RX buffer
  * @param  Character Received byte
  * @param  Error     Error if issue during reception
  * @retval 1 indicates that a complete GUI message have been received
  */
uint32_t GUI_GetMessage(uint8_t Character, uint8_t Error)
{
  uint32_t status = 0;
  static uint16_t counter = 0U;   /* Allows for example to count the number of SOF or EOF we received consecutively */
  static uint16_t cursor = 0U;    /* Our position in the buffer */
  static uint16_t currentSize;    /* How many bytes we should expect */
  static enum receptionStateMachine
  {
    Rstart,
    RonGoing,
    Rsize,
    Rend,
    Rerror
  } Rstate = Rstart;

  if (cursor < TLV_SIZE_MAX)
  {
    PtrDataRx[cursor] = Character;
  }
  else /* buffer too small, overflow */
  {
    cursor = 0U;
    counter = 0U;
    Rstate = Rstart;
    return 0;
  }

  if (Error != 0U)
  {
    Rstate = Rerror;
  }

  switch (Rstate)
  {
    case Rstart :
      if (PtrDataRx[cursor] == TLV_SOF)
      {
        counter++;
      }
      else
      {
        counter = 0U;
        /* cursor is unsigned, but it will inevitably increments at the end of function,
           and we need a 0 at the next pass here */
        cursor = 0xFFFFU;
      }

      if (counter == 4U) /* The whole SOF is received */
      {
        counter = 0U;
        Rstate = Rsize;
      }
      break;
    case Rsize :
      counter++;

      if (counter == 3U) /* We have received the size */
      {
        currentSize = (uint16_t)((PtrDataRx[cursor - 1U]) << 8) + (uint16_t)(PtrDataRx[cursor]);
        if (0U == currentSize)
        {
          Rstate = Rend;
        }
        else
        {
          Rstate = RonGoing;
        }
        counter = 0U;
      }
      break;
    case RonGoing :
      counter++;

      if (counter == currentSize)
      {
        /* When there is no value, the first EOF is handled by Rongoing, before Rend takes control */
        counter = 0U;
        Rstate = Rend;
      }
      break;
    case Rend :
      counter++;
      if ((PtrDataRx[cursor] == TLV_EOF)
          && (PtrDataRx[cursor - 1U] == TLV_EOF)
          && (PtrDataRx[cursor - 2U] == TLV_EOF)
          && (PtrDataRx[cursor - 3U] == TLV_EOF))
      {
        /* The semaphore must be given only in this case, because otherwise
           it means we didn't receive the correct size of bytes */
        if (counter == 4U)
        {
          status = 1U;
        }
        counter = 0U;
        cursor = 0xFFFFU;
        Rstate = Rstart;
      }

      if (cursor == (currentSize + 11U))
      {
        /* No complete EOF arrived. We reset the buffer for safety even if the instruction might be complete. */
        counter = 0U;
        cursor = 0xFFFFU;
        Rstate = Rstart;
      }
      break;
    case Rerror :
      counter = 0U;
      cursor = 0xFFFFU;
      Rstate = Rstart;
      break;
    default:
      break;
  }

  cursor++;
  return status;
}

/**
  * @brief  Answer to a message received by the GUI
  * @param  pMsgToSend Pointer on the message to send
  * @param  pSizeMsg   Pointer on the size of the message to send
  * @retval GUI state
  */
USBPD_GUI_State GUI_SendAnswer(uint8_t **pMsgToSend, uint8_t *pSizeMsg)
{
  /* Extract the port from the tag*/
  uint8_t port = PtrDataRx[TLV_TAG_POSITION] >> GUI_PORT_BIT_POSITION;

  /* Do the appropriate treatment in response to what we have received */
  switch (PtrDataRx[TLV_TAG_POSITION] & 0x1FU)
  {
    case DPM_RESET_REQ:
      /* Reset*/
      return GUI_STATE_RESET;

    case DPM_INIT_REQ:
    {
      Send_DpmInitCnf(port, Processed);
      *pMsgToSend = Processed;
      *pSizeMsg = (uint8_t)(TLV_get_string_length(Processed) + 8U);
      TRACER_EMB_Add(*pMsgToSend, *pSizeMsg);
      GUI_State = GUI_STATE_RUNNING;
      if (0U == port)
      {
        /* Send a notification all the port */
        (void)GUI_FormatAndSendNotification(USBPD_PORT_0,
                                            GUI_NOTIF_ISCONNECTED | GUI_NOTIF_PE_EVENT | GUI_NOTIF_TIMESTAMP,
                                            USBPD_NOTIFY_ALL);
#if USBPD_PORT_COUNT==2
        (void)GUI_FormatAndSendNotification(USBPD_PORT_1,
                                            GUI_NOTIF_ISCONNECTED | GUI_NOTIF_PE_EVENT | GUI_NOTIF_TIMESTAMP,
                                            USBPD_NOTIFY_ALL);
#endif /* USBPD_PORT_COUNT == 2 */
      }
      return GUI_STATE_INIT;
    }

    case DPM_CONFIG_GET_REQ:
      if (0U != port)
      {
        Send_DpmConfigGetCnf((port - 1U), PtrDataRx, Processed);
      }
      else
      {
        Send_DpmConfigGetRej(port, Processed, GUI_REJ_DPM_INVALID_PORT_NUMBER);
      }
      break;
    case DPM_CONFIG_SET_REQ:
      if (0U != port)
      {
        Send_DpmConfigSetCnf((port - 1U), PtrDataRx, Processed);
      }
      else
      {
        Send_DpmConfigGetRej(port, Processed, GUI_REJ_DPM_INVALID_PORT_NUMBER);
      }
      break;
    case DPM_MESSAGE_REQ:
      if (0U != port)
      {
        Request_MessageReq((port - 1U), PtrDataRx, Processed);
      }
      else
      {
        Send_DpmMessageRej(port, Processed, GUI_REJ_DPM_INVALID_PORT_NUMBER);
      }
      break;
    case DPM_REGISTER_READ_REQ:
      if (0U != port)
      {
        /* If size is 0*/
        if ((PtrDataRx[TLV_LENGTH_HIGH_POSITION] == 0U) && (PtrDataRx[TLV_LENGTH_LOW_POSITION] == 0U))
        {
          Send_DpmRegisterReadCnf((port - 1U), Processed, 0xFF);
        }
        else
        {
          /* PtrDataRx[TLV_VALUE_POSITION] is the tag in parameter,
             when only one parameter is needed (cf USBPD GUI specification)*/
          Send_DpmRegisterReadCnf((port - 1U), Processed, PtrDataRx[TLV_VALUE_POSITION]);
        }
      }
      else
      {
        Send_DpmConfigGetRej(port, Processed, GUI_REJ_DPM_INVALID_PORT_NUMBER);
      }
      break;
    case DPM_REGISTER_WRITE_REQ:
      if (0U != port)
      {
        Send_DpmRegisterWriteCnf((port - 1U), Processed, PtrDataRx);
      }
      else
      {
        Send_DpmConfigGetRej(port, Processed, GUI_REJ_DPM_INVALID_PORT_NUMBER);
      }
      break;
    default :
      break;
  }

