STMicroelectronics/STM32CubeH7RS/Utilities/GUI_INTERFACE/gui_api.c
    /* Case Received Request PDO Data information :
    */
    case USBPD_CORE_DATATYPE_RCV_REQ_PDO :
      if (Size == 4U)
      {
        uint8_t *rdo;
        rdo = (uint8_t *)&GUI_SaveInformation[PortNum].RcvRequestDOMsg;
        (void)memcpy(rdo, Ptr, Size);
      }
      break;

#if _STATUS
    case USBPD_CORE_INFO_STATUS :
    {
      uint8_t *info_status;
      info_status = (uint8_t *)&GUI_SaveInformation[PortNum].RcvStatus;
      (void)memcpy(info_status, Ptr, Size);
      break;
    }
#endif /* _STATUS */
#if _PPS
    case USBPD_CORE_PPS_STATUS :
    {
      uint8_t  *ext_capa;
      ext_capa = (uint8_t *)&GUI_SaveInformation[PortNum].RcvPPSStatus;
      (void)memcpy(ext_capa, Ptr, Size);
      break;
    }
#endif /* _PPS */
#if _SRC_CAPA_EXT
    case USBPD_CORE_EXTENDED_CAPA :
    {
      uint8_t  *ext_capa;
      ext_capa = (uint8_t *)&GUI_SaveInformation[PortNum].RcvSRCExtendedCapa;
      (void)memcpy(ext_capa, Ptr, Size);
      break;
    }
#endif /* _SRC_CAPA_EXT */
#if defined(USBPDCORE_SNK_CAPA_EXT)
    case USBPD_CORE_SNK_EXTENDED_CAPA :
    {
      uint8_t  *_snk_ext_capa;
      _snk_ext_capa = (uint8_t *)&GUI_SaveInformation[PortNum].RcvSNKExtendedCapa;
      (void)memcpy(_snk_ext_capa, Ptr, Size);
      break;
    }
#endif /* USBPDCORE_SNK_CAPA_EXT */
#if _MANU_INFO
    case USBPD_CORE_GET_MANUFACTURER_INFO:
    {
      uint8_t *temp = (uint8_t *)Ptr;
      GUI_SaveInformation[PortNum].GetManufacturerInfo.ManufacturerInfoTarget = *temp;
      temp++;
      GUI_SaveInformation[PortNum].GetManufacturerInfo.ManufacturerInfoRef    = *temp;
      break;
    }
#endif /* _MANU_INFO */
#if _BATTERY
    case USBPD_CORE_BATTERY_STATUS:
      GUI_SaveInformation[PortNum].BatteryStatus.d32 = *Ptr;
      break;

    case USBPD_CORE_GET_BATTERY_STATUS:
      GUI_SaveInformation[PortNum].GetBatteryStatus.BatteryStatusRef = *(uint8_t *)Ptr;
      break;

    case USBPD_CORE_GET_BATTERY_CAPABILITY:
    {
      uint8_t *temp = (uint8_t *)Ptr;
      GUI_SaveInformation[PortNum].GetBatteryCapability.BatteryCapRef = *temp;
      break;
    }
#endif /* _BATTERY */
#if _ALERT
    case USBPD_CORE_ALERT:
    {
      uint8_t  *alert;
      alert = (uint8_t *)&GUI_SaveInformation[PortNum].RcvAlert.d32;
      (void)memcpy(alert, Ptr, Size);
      break;
    }
#endif /* _ALERT */
#if defined(_VCONN_SUPPORT)
    case GUI_VDM_CABLE_INFO:
    {
      uint8_t  *disco_ident;
      disco_ident = (uint8_t *)&GUI_SaveInformation[PortNum].VDM_DiscoCableIdentify;
      (void)memcpy(disco_ident, Ptr, Size);
      break;
    }
#endif /* _VCONN_SUPPORT */

    /* In case of unexpected data type (Set request could not be fulfilled) :
     */
    default :
      break;
  }
}

/**
  * @brief  Register callback function to be used with Free Text feature
  * @param  CB_FreeText Callback function to register (port number, payload and size)
  * @retval None
  */
void GUI_RegisterCallback_FreeText(USBPD_StatusTypeDef(*CB_FreeText)(uint8_t, uint8_t *, uint16_t))
{
  pCB_FreeText = CB_FreeText;
}

/**
  * @}
  */

/** @defgroup USBPD_GUI_API_Private_Functions GUI API Private Functions
  * @{
  */
/**
  * @brief  Send DPM_INIT_CNF message to GUI
  * @param  PortNum   Port number
  * @param  pEncodedMsg Pointer on the message to be encoded
  * @retval None
  */
static void Send_DpmInitCnf(uint8_t PortNum, uint8_t *pEncodedMsg)
{
  TLV_ToSend_Data_t ToSendTLV;
  (void)TLV_init_encode(&ToSendTLV, __GUI_SET_TAG_ID(PortNum, DPM_INIT_CNF), TLV_SIZE_MAX, pEncodedMsg);

  /* Information by board */
  if (0U == PortNum)
  {
    /* HWBoardVersion */
    const uint8_t *hwversion;
    if (NULL != pCB_HWBoardVersion)
    {
      hwversion = pCB_HWBoardVersion();
    }
    else
    {
      hwversion = (uint8_t *) "UNKNOWN";
    }
    (void)TLV_add(&ToSendTLV, (uint8_t)GUI_INIT_HWBOARDVERSION, (uint16_t)(strlen((const char *)hwversion)), hwversion);

    /* HWPDType */
    const uint8_t *hwpdtype;
    if (NULL != pCB_HWBoardVersion)
    {
      hwpdtype  = pCB_HWPDType();
    }
    else
    {
      hwpdtype = (uint8_t *) "UNKNOWN";
    }
    (void)TLV_add(&ToSendTLV, (uint8_t)GUI_INIT_HWPDTYPE, (uint16_t)(strlen((const char *)hwpdtype)), hwpdtype);

    /* NbPortMax */
    (void)TLV_add(&ToSendTLV, (uint8_t)GUI_INIT_NBPORTMAX, 1, (uint8_t[]) { USBPD_PORT_COUNT });
    /* FW Version */
    (void)TLV_add(&ToSendTLV, (uint8_t)GUI_INIT_FWVERSION, 8, (uint8_t[])
    {
      (USBPD_FW_VERSION & 0x000000FFU),
      (USBPD_FW_VERSION & 0x0000FF00U) >> 8,
      (USBPD_FW_VERSION & 0x00FF0000U) >> 16,
      (USBPD_FW_VERSION & 0xFF000000U) >> 24,
      (_LIB_ID & 0x000000FFU),
      (_LIB_ID & 0x0000FF00U) >> 8,
      (_LIB_ID & 0x00FF0000U) >> 16,
      (_LIB_ID & 0xFF000000U) >> 24
    }
                 );
    /* Start Port number */
    (void)TLV_add(&ToSendTLV, (uint8_t)GUI_INIT_NB_PORT_START, 1, (uint8_t[]) { USBPD_START_PORT_NUMBER });
    /* Start Port number */
    (void)TLV_add(&ToSendTLV, (uint8_t)GUI_INIT_NB_PORT_START, 1, (uint8_t[]) { USBPD_START_PORT_NUMBER });

    /* Original settings */
    (void)TLV_add(&ToSendTLV, (uint8_t)GUI_INIT_ORIGINAL_SETTINGS, 1, (uint8_t *)&GUI_OriginalSettings);

    TLV_deinit_encode(&ToSendTLV);
  }
  else
  {
    uint16_t settings;
    uint8_t port = PortNum - 1U;
#if defined(MB1303)
    uint16_t fake = 0xADDE;
#endif /*MB1303*/
    /* TypeCSpecVersion & PDSpecRevision */
    settings = (uint16_t)DPM_Settings[port].PE_SpecRevision;
    (void)TLV_add(&ToSendTLV, (uint8_t)GUI_INIT_TYPECSPECREVISION, 2, (uint8_t[]) { 0x12, settings });
    /* Extended Messages UnCkunked */
    settings = (uint16_t)DPM_Settings[port].PE_PD3_Support.d.PE_UnchunkSupport;
    (void)TLV_add(&ToSendTLV, (uint8_t)GUI_INIT_EXTENDEDMESSAGESUNCKUNKED, 1, (uint8_t *)&settings);
    /* AccessorySupp */
    settings = (uint16_t)DPM_Settings[port].CAD_AccesorySupport;
    (void)TLV_add(&ToSendTLV, (uint8_t)GUI_INIT_ACCESSORYSUPP, 1, (uint8_t *)&settings);
    /*PowerAccessoryDetection*/
    settings = (uint16_t)DPM_USER_Settings[port].PWR_AccessoryDetection;
    (void)TLV_add(&ToSendTLV, (uint8_t)GUI_INIT_POWERACCESSORYDETECTION, 1, (uint8_t *)&settings);
    /*PowerAccessoryTransition*/
    settings = (uint16_t)DPM_USER_Settings[port].PWR_AccessoryTransition;
    (void)TLV_add(&ToSendTLV, (uint8_t)GUI_INIT_POWERACCESSORYTRANSITION, 1, (uint8_t *)&settings);
    /*IsCable*/
    (void)TLV_add(&ToSendTLV, (uint8_t)GUI_INIT_ISCABLE, 1, (uint8_t[]) { 0x00 });
    /*TryFeature*/
    settings = (uint16_t)DPM_Settings[port].CAD_TryFeature;
    (void)TLV_add(&ToSendTLV, (uint8_t)GUI_INIT_TRYFEATURE, 1, (uint8_t *)&settings);
    /*RpResistorValue*/
    settings = (uint16_t)DPM_USER_Settings[port].PWR_RpResistorValue;
    (void)TLV_add(&ToSendTLV, (uint8_t)GUI_INIT_RPRESISTORVALUE, 1, (uint8_t *)&settings);
    /*USBSupport*/
    settings = (uint16_t)DPM_USER_Settings[port].USB_Support;
    (void)TLV_add(&ToSendTLV, (uint8_t)GUI_INIT_USBSUPPORT, 1, (uint8_t *)&settings);
    /*USBDevice*/
    settings = (uint16_t)DPM_USER_Settings[port].USB_Device;
    (void)TLV_add(&ToSendTLV, (uint8_t)GUI_INIT_USBDEVICE, 1, (uint8_t *)&settings);
    /*USBHost*/
    settings = (uint16_t)DPM_USER_Settings[port].USB_Host;
    (void)TLV_add(&ToSendTLV, (uint8_t)GUI_INIT_USBHOST, 1, (uint8_t *)&settings);
    /*Externally_Powered*/
    settings = (uint16_t)DPM_USER_Settings[port].PWR_UnconstrainedPower;
    (void)TLV_add(&ToSendTLV, (uint8_t)GUI_INIT_UNCONSTRAINED_POWERED, 1, (uint8_t *)&settings);
    /*USBSuspendSupport*/
    settings = (uint16_t)DPM_USER_Settings[port].USB_SuspendSupport;
    (void)TLV_add(&ToSendTLV, (uint8_t)GUI_INIT_USBSUSPENDSUPPORT, 1, (uint8_t *)&settings);
#if defined(MB1303)
    /*VConnDischarge*/
    (void)TLV_add(&ToSendTLV, (uint8_t)GUI_INIT_VCONNDISCHARGE, 2, (uint8_t *)&fake);
    /*VConnLim*/
    (void)TLV_add(&ToSendTLV, (uint8_t)GUI_INIT_VCONNILIM, 2, (uint8_t *)&fake);
    /*VConnLimValue*/
    (void)TLV_add(&ToSendTLV, (uint8_t)GUI_INIT_VCONNILIMVALUE, 2, (uint8_t *)&fake);
    /*VConnMonitoring*/
    (void)TLV_add(&ToSendTLV, (uint8_t)GUI_INIT_VCONNMONITORING, 2, (uint8_t *)&fake);
    /*VConnThresholdUVLO*/
    (void)TLV_add(&ToSendTLV, (uint8_t)GUI_INIT_VCONNTHRESHOLDUVLO, 2, (uint8_t *)&fake);
    /*VConnSupply*/
    (void)TLV_add(&ToSendTLV, (uint8_t)GUI_INIT_VCONNSUPPLY, 2, (uint8_t *)&fake);
#endif /*MB1303*/

    TLV_deinit_encode(&ToSendTLV);
  }
}

/**
  * @brief      Execution of the received message
  * @param      PortNum     Port number
  * @param      instruction Pointer on the instruction
  * @param      pEncodedMsg Pointer on the encoded message
  * @note       Generation of a TLV instruction to send in the context of DPM_MESSAGE
  * @retval     None
  */
static void Request_MessageReq(uint8_t PortNum, uint8_t *instruction, uint8_t *pEncodedMsg)
{
  USBPD_StatusTypeDef status = USBPD_ERROR;
  TLV_Received_Data_t process_tlv;
  TLV_ToSend_Data_t send_tlv;

  (void)TLV_init_decode(&process_tlv, instruction);
  (void)TLV_init_encode(&send_tlv, __GUI_SET_TAG_ID((PortNum + 1), DPM_MESSAGE_CNF), TLV_SIZE_MAX, pEncodedMsg);

