STMicroelectronics/STM32CubeH7RS/Utilities/GUI_INTERFACE/gui_api.c
  /* Only applies if an error was specified (= if the case couldn't success)*/
  if (USBPD_OK != status)
  {
    switch (status)
    {
      case USBPD_BUSY:
        error = GUI_REJ_DPM_NOT_READY;
        break;
      case USBPD_TIMEOUT:
        error = GUI_REJ_DPM_TIMEOUT;
        break;
      case USBPD_NOTSUPPORTED:
      case USBPD_ERROR:
      default:
        error = GUI_REJ_DPM_REJECT;
        break;
    }
    TLV_deinit_encode(&send_tlv);
    (void)TLV_init_encode(&send_tlv, __GUI_SET_TAG_ID((PortNum + 1), DPM_MESSAGE_REJ), TLV_SIZE_MAX,
                          pEncodedMsg); /* Turn the tag 0x0A into 0x0B to signal an error*/
    (void)TLV_addValue(&send_tlv, (uint8_t *)&error, 1);
  }

  TLV_deinit_encode(&send_tlv);
  TLV_deinit_decode(&process_tlv);
}

/**
  * @brief  Application of the received configuration
  * @param  PortNum     Port number
  * @param  instruction Pointer on the instruction
  * @param  pEncodedMsg Pointer on the encoded message
  * @note   Generation of a TLV instruction to send in the context of DPM_CONFIG_SET
  * @retval None
  */
static void Send_DpmConfigSetCnf(uint8_t PortNum, uint8_t *instruction, uint8_t *pEncodedMsg)
{
  TLV_ToSend_Data_t send_tlv;
  TLV_Received_Data_t process_tlv;
  /*
    In case there is an error, we use this variable to know when to send a DPM_CONFIG_SET instead
    of a DPM_MESSAGE_CNF. This variable contains the cause if there is one.
  */
  uint8_t *value;
  uint16_t size;
  uint16_t dcdrp = 0;
  uint8_t error = 0xFF;
  uint8_t param_not_applicated[GUI_PARAM_ALL]; /* List of parameters who could not be applied. */
  uint8_t counter_param_not_applicated = 0U;  /* Counter of not applicated parameters */
  uint8_t tag;
  uint8_t flag_drp = 0;
  uint8_t tdrp = 0;

  (void)TLV_init_decode(&process_tlv, instruction);
  /* pEncodedMsg can be sent as it is at this point, if there isn't any error during application of settings*/
  (void)TLV_init_encode(&send_tlv, __GUI_SET_TAG_ID((PortNum + 1), DPM_CONFIG_SET_CNF), TLV_SIZE_MAX, pEncodedMsg);

  /* Do while loop, used to parse and apply each parameter */
  while ((uint8_t)(0xFF) != TLV_get(&process_tlv, &tag, &size, &value))
    /*
      As long as we haven't read all the parameters. If error is set, we continue to loop
      to apply the other parameters if it's because of a DPM_REJECT
      While loop, used to parse and apply each parameter
    */
  {
    switch ((USBPD_GUI_Tag_Param)tag)
      /*
        Each case should:
        - Apply his specific parameter. If data is needed, it can be found in the value pointer
        - In case of success, do nothing else
        - Otherwise if there is an error, set the error variable according to it (cf USBPD_GUI_Specification)
        - If the error is DPM_REJECT (0x00), add the parameter tag to param_not_applicated, using the
          counter counter_param_not_applicated. It allows to list the rejected parameters in the DPM_CONFIG_REJ
      */
    {
      case GUI_PARAM_SOP :
#if !defined(USBPDCORE_LIB_NO_PD)
        /* SOP & SOP1 & SOP2 */
        /* SOP1_Debug & SOP2_Debug not implemented */
        DPM_Settings[PortNum].PE_SupportedSOP = (USBPD_SupportedSOP_TypeDef)value[0];
#endif /* !USBPDCORE_LIB_NO_PD */
        break;
      case GUI_PARAM_FASTROLESWAP :
        /*FastRoleSwap*/
        DPM_Settings[PortNum].PE_PD3_Support.d.PE_FastRoleSwapSupport = value[0];
        break;
      case GUI_PARAM_DATAROLESWAP_TO_UFP :
        /*DataRoleSwap to UFP */
        DPM_USER_Settings[PortNum].PE_DR_Swap_To_UFP = value[0];
        break;
      case GUI_PARAM_DATAROLESWAP_TO_DFP :
        /*DataRoleSwap to DFP */
        DPM_USER_Settings[PortNum].PE_DR_Swap_To_DFP = value[0];
        break;
      case GUI_PARAM_DEFAULTPOWERROLE :
        /*DefaultPowerRole*/
        DPM_Settings[PortNum].PE_DefaultRole = (USBPD_PortPowerRole_TypeDef)value[0];
        break;
#if !defined(USBPDCORE_LIB_NO_PD)
      case GUI_PARAM_DRP_SUPPORT :
        /*DRP_Support*/
        DPM_Settings[PortNum].PE_RoleSwap = value[0];
        break;
      case GUI_PARAM_CADROLETOGGLE :
        /*CADRoleToggle*/
        DPM_Settings[PortNum].CAD_RoleToggle = value[0];
        break;
      case GUI_PARAM_PE_SCAP_HR :
        /*PE_SCAP_HR*/
        DPM_Settings[PortNum].PE_CapscounterSupport = value[0];
        break;
      case GUI_PARAM_VCONNSWAP :
        /*VConnSwap*/
        DPM_USER_Settings[PortNum].PE_VconnSwap = value[0];
        break;
#if defined(_VDM)
      case GUI_PARAM_VDM_SUPPORT :
        /* DRP Support */
        DPM_Settings[PortNum].PE_VDMSupport = value[0];
        break;
#endif /*_VDM*/
      case GUI_PARAM_PING_SUPPORT :
        /* Ping Support */
        DPM_Settings[PortNum].PE_PingSupport = value[0];
        break;
      case GUI_PARAM_PPS_SUPPORT :
        DPM_Settings[PortNum].PE_PD3_Support.PD3_Support = USBPD_LE16(&value[0]);
        break;
#endif /* !USBPDCORE_LIB_NO_PD */
#if defined(_SNK) || defined(_DRP)
      case GUI_PARAM_SNK_PDO :
      {
        uint32_t index_pdo;
        uint32_t index_gui;
        uint32_t pdo;
#if USBPD_PORT_COUNT==2
        if (USBPD_PORT_0 == PortNum)
#endif /* USBPD_PORT_COUNT==2 */
        {
          (void)memset(PORT0_PDO_ListSNK, 0, sizeof(PORT0_PDO_ListSNK));
          index_pdo = 0;
          for (index_gui = 0; index_gui < size; index_gui = index_gui + 4U)
          {
            pdo = USBPD_LE32(&value[index_gui]);
            PORT0_PDO_ListSNK[index_pdo] = pdo;
            index_pdo++;
          }
          USBPD_NbPDO[0] = (uint8_t)(size / 4U);
          UpdateSNKPowerPort0();
        }
#if USBPD_PORT_COUNT==2
        else
        {
          (void)memset(PORT1_PDO_ListSNK, 0, sizeof(PORT1_PDO_ListSNK));
          index_pdo = 0;
          for (index_gui = 0; index_gui < size; index_gui = index_gui + 4U)
          {
            pdo = USBPD_LE32(&value[index_gui]);
            PORT1_PDO_ListSNK[index_pdo] = pdo;
            index_pdo++;
          }
          USBPD_NbPDO[2] = (uint8_t)(size / 4U);
          UpdateSNKPowerPort1();
        }
#endif /* USBPD_PORT_COUNT==2 */
        break;
      }
#endif /* (_SNK) || (_DRP) */
#if defined(_SRC) || defined(_DRP)
      case GUI_PARAM_SRC_PDO :
      {
        uint32_t index_pdo;
        uint32_t index_gui;
        uint32_t pdo;
#if USBPD_PORT_COUNT==2
        if (USBPD_PORT_0 == PortNum)
#endif /* USBPD_PORT_COUNT==2 */
        {
          (void)memset(PORT0_PDO_ListSRC, 0, sizeof(PORT0_PDO_ListSRC));
          index_pdo = 0;
          for (index_gui = 0; index_gui < size; index_gui = index_gui + 4U)
          {
            pdo = USBPD_LE32(&value[index_gui]);
            PORT0_PDO_ListSRC[index_pdo] = pdo;
            index_pdo++;
          }
          USBPD_NbPDO[1] = (uint8_t)(size / 4U);
        }
#if USBPD_PORT_COUNT==2
        else
        {
          (void)memset(PORT1_PDO_ListSRC, 0, sizeof(PORT1_PDO_ListSRC));
          index_pdo = 0;
          for (index_gui = 0; index_gui < size; index_gui = index_gui + 4U)
          {
            pdo = USBPD_LE32(&value[index_gui]);
            PORT1_PDO_ListSRC[index_pdo] = pdo;
            index_pdo++;
          }
          USBPD_NbPDO[3] = (uint8_t)(size / 4U);
        }
#endif /* USBPD_PORT_COUNT==2 */
        break;
      }
#endif /* (_SRC) || (_DRP) */
      case GUI_PARAM_TDRP :
        tdrp = value[0];
        DPM_USER_Settings[PortNum].CAD_tDRP = tdrp;
        flag_drp = 1;
        break;
      case GUI_PARAM_DCSRC_DRP :
        dcdrp = value[0];
        DPM_USER_Settings[PortNum].CAD_dcSRC_DRP = dcdrp;
        flag_drp = 1;
        break;
      case GUI_PARAM_RESPONDS_TO_DISCOV_SOP :
        DPM_Settings[PortNum].PE_RespondsToDiscovSOP = value[0];
        break;
      case GUI_PARAM_ATTEMPTS_DISCOV_SOP :
        DPM_Settings[PortNum].PE_AttemptsDiscovSOP = value[0];
        break;
      case GUI_PARAM_XID_SOP :
        DPM_ID_Settings[PortNum].XID       = USBPD_LE32(&value[0]);
        break;
      case GUI_PARAM_USB_VID_SOP :
        DPM_ID_Settings[PortNum].VID       = USBPD_LE16(&value[0]);
        break;
      case GUI_PARAM_PID_SOP :
        DPM_ID_Settings[PortNum].PID       = USBPD_LE16(&value[0]);
        break;
#if defined(_VDM)
      case GUI_PARAM_DATA_CAPABLE_AS_USB_HOST_SOP :
        DPM_VDM_Settings[PortNum].VDM_USBHostSupport    = (USBPD_USBCapa_TypeDef)value[0];
        break;
      case GUI_PARAM_DATA_CAPABLE_AS_USB_DEVICE_SOP :
        DPM_VDM_Settings[PortNum].VDM_USBDeviceSupport  = (USBPD_USBCapa_TypeDef)value[0];
        break;
      case GUI_PARAM_PRODUCT_TYPE_SOP :
        DPM_VDM_Settings[PortNum].VDM_ProductTypeUFPorCP = (USBPD_ProductType_TypeDef)value[0];
        break;
      case GUI_PARAM_MODAL_OPERATION_SUPPORTED_SOP :
        DPM_VDM_Settings[PortNum].VDM_ModalOperation    = (USBPD_ModalOp_TypeDef)value[0];
        break;
      case GUI_PARAM_BCDDEVICE_SOP :
        DPM_VDM_Settings[PortNum].VDM_bcdDevice_SOP     = USBPD_LE16(&value[0]);
        break;
#endif /* _VDM */
      case GUI_PARAM_MEASUREREPORTING :
        /* MeasurementReporting */
        GUI_USER_Params[PortNum].u.MeasurementReporting = value[0];
        break;
#if _MANU_INFO
      case GUI_PARAM_MANUINFOPORT_VID :
        DPM_USER_Settings[PortNum].DPM_ManuInfoPort.VID = USBPD_LE16(&value[0]);
        DPM_USER_Settings[PortNum].DPM_ManuInfoPort.PID = USBPD_LE16(&value[2]);
        size -= 4U;
        (void)memcpy(DPM_USER_Settings[PortNum].DPM_ManuInfoPort.ManuString, &value[4], size);
        break;
#endif /* _MANU_INFO */
      default :
        error = (uint8_t)GUI_REJ_DPM_REJECT;
        param_not_applicated[counter_param_not_applicated] = tag;
        counter_param_not_applicated++;
        break;
    }
  }

#if !defined(USBPDCORE_LIB_NO_PD)
  /* Updtate CAD_SNKToggleTime & CAD_SRCToggleTime only if TDRP and/or DC_SRC_DRP have been received */
  if (1U == flag_drp)
  {
    uint16_t calcul;
    if (0U == tdrp)
    {
      tdrp = (uint8_t)(DPM_Settings[PortNum].CAD_SNKToggleTime + DPM_Settings[PortNum].CAD_SRCToggleTime);
    }
    if (0U == dcdrp)
    {
      dcdrp = (uint16_t)
              ((DPM_Settings[PortNum].CAD_SRCToggleTime * 100U)
               / (DPM_Settings[PortNum].CAD_SNKToggleTime + DPM_Settings[PortNum].CAD_SRCToggleTime));
    }
    calcul = (tdrp * dcdrp) / 100U;
    DPM_Settings[PortNum].CAD_SRCToggleTime = (uint8_t)calcul;
    calcul = tdrp * (100U - dcdrp) / 100U;
    DPM_Settings[PortNum].CAD_SNKToggleTime = (uint8_t)calcul;
  }
#endif /* !USBPDCORE_LIB_NO_PD */

