STMicroelectronics/STM32CubeH7RS/Utilities/GUI_INTERFACE/gui_api.c
  /* Only applies if an error was specified. Will send a DPM_CONFIG_REJ instead of DPM_CONFIG_SET_CNF*/
  if (error != 0xFFU)
  {
    TLV_deinit_encode(&send_tlv);
    (void)TLV_init_encode(&send_tlv, __GUI_SET_TAG_ID((PortNum + 1), DPM_CONFIG_REJ), TLV_SIZE_MAX, pEncodedMsg);
    (void)TLV_addValue(&send_tlv, &error, 1);

    /* If the cause of error is DPM_REJECT, we have to list the tag of parameters which didn't pass */
    if (error != 0U)
    {
      uint32_t index;
      for (index = 0; index < counter_param_not_applicated; index++)
      {
        (void)TLV_addValue(&send_tlv, &param_not_applicated[index], 1);
      }
    }
    TLV_deinit_encode(&send_tlv);
  }
}

/**
  * @brief  Send a DPM_CONFIG_GET_CNF message to the GUI with the current configuration of the specified port.
  * @param  PortNum     Current port number.
  * @param  instruction TLV instruction received.
  * @param  pEncodedMsg Pointer to the encoded message.
  * @retval None
  */
static void Send_DpmConfigGetCnf(uint8_t PortNum, uint8_t *instruction, uint8_t *pEncodedMsg)
{
  TLV_ToSend_Data_t send_tlv;
  (void)TLV_init_encode(&send_tlv, __GUI_SET_TAG_ID((PortNum + 1), DPM_CONFIG_GET_CNF), TLV_SIZE_MAX, pEncodedMsg);
  uint16_t length = TLV_get_string_length(instruction) - TLV_HEADER_SIZE;
  uint8_t index = 0;
  uint8_t param;

  /* This is a state machine. */
  do
  {
    /* If there is no parameters, we go through each case of the state machine in one pass. (conditional breaks) */
    if (0U == length)
    {
      param = (uint8_t)GUI_PARAM_ALL;
    }
    else
    {
      /* If there are, we loop the state machine and go through one case each time. */
      param = instruction[TLV_VALUE_POSITION + index];
    }

    /*
    Each case should simply use the TLV_add function to insert his corresponding data,
    as suggested in comment. Manual cast to (uint8_t *) may be required.
    */
    switch ((USBPD_GUI_Tag_Param)param)
    {
      case GUI_PARAM_ALL :
#if !defined(USBPDCORE_LIB_NO_PD)
      case GUI_PARAM_SOP :
      {
        /* SOP & SOP1 & SOP2 */
        /* SOP1_Debug & SOP2_Debug not implemented */
        uint8_t settings = (uint8_t)DPM_Settings[PortNum].PE_SupportedSOP;
        (void)TLV_add(&send_tlv, (uint8_t)GUI_PARAM_SOP, 1, &settings);
        if (0U != length)
        {
          break;
        }
      }
      case GUI_PARAM_FASTROLESWAP :
      {
        /*FastRoleSwap*/
        uint8_t settings = (uint8_t)DPM_Settings[PortNum].PE_PD3_Support.d.PE_FastRoleSwapSupport;
        (void)TLV_add(&send_tlv, (uint8_t)GUI_PARAM_FASTROLESWAP, 1, &settings);
        if (0U != length)
        {
          break;
        }
      }
#endif /* !USBPDCORE_LIB_NO_PD */
      case GUI_PARAM_DATAROLESWAP_TO_UFP :
      {
        /* DataRoleSwap to UFP */
        uint8_t settings = (uint8_t)DPM_USER_Settings[PortNum].PE_DR_Swap_To_UFP;
        (void)TLV_add(&send_tlv, (uint8_t)GUI_PARAM_DATAROLESWAP_TO_UFP, 1, &settings);
        if (0U != length)
        {
          break;
        }
      }
      case GUI_PARAM_DATAROLESWAP_TO_DFP :
      {
        /* DataRoleSwap to DFP */
        uint8_t settings = (uint8_t)DPM_USER_Settings[PortNum].PE_DR_Swap_To_DFP;
        (void)TLV_add(&send_tlv, (uint8_t)GUI_PARAM_DATAROLESWAP_TO_DFP, 1, &settings);
        if (0U != length)
        {
          break;
        }
      }
      case GUI_PARAM_DEFAULTPOWERROLE :
      {
        /*DefaultPowerRole*/
        uint8_t settings = (uint8_t)DPM_Settings[PortNum].PE_DefaultRole;
        (void)TLV_add(&send_tlv, (uint8_t)GUI_PARAM_DEFAULTPOWERROLE, 1, &settings);
        if (0U != length)
        {
          break;
        }
      }
#if !defined(USBPDCORE_LIB_NO_PD)
      case GUI_PARAM_DRP_SUPPORT :
      {
        /*DRP_Support*/
        uint8_t settings = (uint8_t)DPM_Settings[PortNum].PE_RoleSwap;
        (void)TLV_add(&send_tlv, (uint8_t)GUI_PARAM_DRP_SUPPORT, 1, &settings);
        if (0U != length)
        {
          break;
        }
      }
      case GUI_PARAM_CADROLETOGGLE :
      {
        /*CADRoleToggle*/
        uint8_t settings = (uint8_t)DPM_Settings[PortNum].CAD_RoleToggle;
        (void)TLV_add(&send_tlv, (uint8_t)GUI_PARAM_CADROLETOGGLE, 1, &settings);
        if (0U != length)
        {
          break;
        }
      }
      case GUI_PARAM_PE_SCAP_HR :
      {
        /*PE_SCAP_HR*/
        uint8_t settings = (uint8_t)DPM_Settings[PortNum].PE_CapscounterSupport;
        (void)TLV_add(&send_tlv, (uint8_t)GUI_PARAM_PE_SCAP_HR,  1, &settings);
        if (0U != length)
        {
          break;
        }
      }
#if defined(_VDM)
      case GUI_PARAM_VDM_SUPPORT :
      {
        /* DRP Support */
        uint8_t settings = (uint8_t)DPM_Settings[PortNum].PE_VDMSupport;
        (void)TLV_add(&send_tlv, (uint8_t)GUI_PARAM_VDM_SUPPORT, 1, &settings);
        if (0U != length)
        {
          break;
        }
      }
#endif /*_VDM*/
      case GUI_PARAM_PING_SUPPORT :
      {
        /* Ping Support */
        uint8_t settings = (uint8_t)DPM_Settings[PortNum].PE_PingSupport;
        (void)TLV_add(&send_tlv, (uint8_t)GUI_PARAM_PING_SUPPORT, 1, &settings);
        if (0U != length)
        {
          break;
        }
      }
      case GUI_PARAM_PPS_SUPPORT :
      {
        /* PD3 Support */
        uint16_t settings = (uint16_t)DPM_Settings[PortNum].PE_PD3_Support.PD3_Support;
        (void)TLV_add(&send_tlv, (uint8_t)GUI_PARAM_PPS_SUPPORT, 2, (uint8_t *)&settings);
        if (0U != length)
        {
          break;
        }
      }
#endif /* !USBPDCORE_LIB_NO_PD */
      case GUI_PARAM_VCONNSWAP :
      {
        /*VConnSwap*/
        uint8_t settings = (uint8_t)DPM_USER_Settings[PortNum].PE_VconnSwap;
        (void)TLV_add(&send_tlv, (uint8_t)GUI_PARAM_VCONNSWAP, 1, &settings);
        if (0U != length)
        {
          break;
        }
      }
#if defined(_SNK) || defined(_DRP)
      case GUI_PARAM_SNK_PDO :
      {
        uint8_t *list_pdo;
        uint8_t nb_pdo;
#if USBPD_PORT_COUNT==2
        if (USBPD_PORT_0 == PortNum)
#endif /* USBPD_PORT_COUNT==2 */
        {
          nb_pdo    =  USBPD_NbPDO[0];
          list_pdo  = (uint8_t *)PORT0_PDO_ListSNK;
        }
#if USBPD_PORT_COUNT==2
        else
        {
          nb_pdo    =  USBPD_NbPDO[2];
          list_pdo  = (uint8_t *)PORT1_PDO_ListSNK;
        }
#endif /* USBPD_PORT_COUNT==2 */
        (void)TLV_add(&send_tlv, (uint8_t)GUI_PARAM_SNK_PDO, ((uint16_t)(nb_pdo) * 4U), list_pdo);
      }
      if (0U != length)
      {
        break;
      }
#endif /* _SNK || _DRP */
#if defined(_SRC) || defined(_DRP)
      case GUI_PARAM_SRC_PDO :
      {
        uint8_t *list_pdo;
        uint8_t nb_pdo;
#if USBPD_PORT_COUNT==2
        if (USBPD_PORT_0 == PortNum)
#endif /* USBPD_PORT_COUNT==2 */
        {
          nb_pdo    =  USBPD_NbPDO[1];
          list_pdo  = (uint8_t *)PORT0_PDO_ListSRC;
        }
#if USBPD_PORT_COUNT==2
        else
        {
          nb_pdo    =  USBPD_NbPDO[3];
          list_pdo  = (uint8_t *)PORT1_PDO_ListSRC;
        }
#endif /* USBPD_PORT_COUNT==2 */
        (void)TLV_add(&send_tlv, (uint8_t)GUI_PARAM_SRC_PDO, ((uint16_t)(nb_pdo) * 4U), list_pdo);
      }
      if (0U != length)
      {
        break;
      }
#endif /* _SRC || _DRP */
      case GUI_PARAM_TDRP :
      {
        /* Calculate the current value of tDRP (value between 50ms and 100ms) */
        uint8_t value = (uint8_t)DPM_USER_Settings[PortNum].CAD_tDRP;
        (void)TLV_add(&send_tlv, (uint8_t)GUI_PARAM_TDRP, 1, &value);
      }
      if (0U != length)
      {
        break;
      }
      case GUI_PARAM_DCSRC_DRP :
      {
        /* Calculate the current value of tDRP (value between 50ms and 100ms) */
        uint8_t value = (uint8_t)DPM_USER_Settings[PortNum].CAD_dcSRC_DRP;
        (void)TLV_add(&send_tlv, (uint8_t)GUI_PARAM_DCSRC_DRP, 1, &value);
      }
      if (0U != length)
      {
        break;
      }
#if !defined(USBPDCORE_LIB_NO_PD)
      case GUI_PARAM_RESPONDS_TO_DISCOV_SOP :
      {
        uint8_t settings = (uint8_t)DPM_Settings[PortNum].PE_RespondsToDiscovSOP;
        (void)TLV_add(&send_tlv, (uint8_t)GUI_PARAM_RESPONDS_TO_DISCOV_SOP, 1, &settings);
      }
      if (0U != length)
      {
        break;
      }
      case GUI_PARAM_ATTEMPTS_DISCOV_SOP :
      {
        uint8_t settings = (uint8_t)DPM_Settings[PortNum].PE_AttemptsDiscovSOP;
        (void)TLV_add(&send_tlv, (uint8_t)GUI_PARAM_ATTEMPTS_DISCOV_SOP, 1, &settings);
      }
      if (0U != length)
      {
        break;
      }
#endif /* !USBPDCORE_LIB_NO_PD */
      case GUI_PARAM_XID_SOP :
      {
        uint32_t value = DPM_ID_Settings[PortNum].XID;
        (void)TLV_add(&send_tlv, (uint8_t)GUI_PARAM_XID_SOP, 4, (uint8_t *)&value);
      }
      if (0U != length)
      {
        break;
      }
      case GUI_PARAM_USB_VID_SOP :
      {
        uint16_t value = (uint16_t)DPM_ID_Settings[PortNum].VID;
        (void)TLV_add(&send_tlv, (uint8_t)GUI_PARAM_USB_VID_SOP, 2, (uint8_t *)&value);
      }
      if (0U != length)
      {
        break;
      }
      case GUI_PARAM_PID_SOP :
      {
        uint16_t value = (uint16_t)DPM_ID_Settings[PortNum].PID;
        (void)TLV_add(&send_tlv, (uint8_t)GUI_PARAM_PID_SOP, 2, (uint8_t *)&value);
      }
      if (0U != length)
      {
        break;
      }
#if defined(_VDM)
      case GUI_PARAM_DATA_CAPABLE_AS_USB_HOST_SOP :
      {
        uint8_t settings = (uint8_t)DPM_VDM_Settings[PortNum].VDM_USBHostSupport;
        (void)TLV_add(&send_tlv, (uint8_t)GUI_PARAM_DATA_CAPABLE_AS_USB_HOST_SOP, 1, &settings);
      }
      if (0U != length)
      {
        break;
      }
      case GUI_PARAM_DATA_CAPABLE_AS_USB_DEVICE_SOP :
      {
        uint8_t settings = (uint8_t)DPM_VDM_Settings[PortNum].VDM_USBDeviceSupport;
        (void)TLV_add(&send_tlv, (uint8_t)GUI_PARAM_DATA_CAPABLE_AS_USB_DEVICE_SOP, 1, &settings);
      }
      if (0U != length)
      {
        break;
      }
      case GUI_PARAM_PRODUCT_TYPE_SOP :
      {
        uint8_t settings = (uint8_t)DPM_VDM_Settings[PortNum].VDM_ProductTypeUFPorCP;
        (void)TLV_add(&send_tlv, (uint8_t)GUI_PARAM_PRODUCT_TYPE_SOP, 1, &settings);
      }
      if (0U != length)
      {
        break;
      }
      case GUI_PARAM_MODAL_OPERATION_SUPPORTED_SOP :
      {
        uint8_t settings = (uint8_t)DPM_VDM_Settings[PortNum].VDM_ModalOperation;
        (void)TLV_add(&send_tlv, (uint8_t)GUI_PARAM_MODAL_OPERATION_SUPPORTED_SOP, 1, &settings);
      }
      if (0U != length)
      {
        break;
      }
      case GUI_PARAM_BCDDEVICE_SOP :
      {
        uint16_t value = (uint16_t)DPM_VDM_Settings[PortNum].VDM_bcdDevice_SOP;
        (void)TLV_add(&send_tlv, (uint8_t)GUI_PARAM_BCDDEVICE_SOP, 2, (uint8_t *)&value);
      }
      if (0U != length)
      {
        break;
      }
#endif /* _VDM */
      case GUI_PARAM_MEASUREREPORTING :
      {
        uint8_t settings = (uint8_t)GUI_USER_Params[PortNum].u.MeasurementReporting;
        (void)TLV_add(&send_tlv, (uint8_t)GUI_PARAM_MEASUREREPORTING, 1, &settings);
      }
      if (0U != length)
      {
        break;
      }
#if _MANU_INFO
      case GUI_PARAM_MANUINFOPORT_VID :
      {
        uint8_t size = (uint8_t)sizeof(DPM_USER_Settings[PortNum].DPM_ManuInfoPort.ManuString) + 4U;
        (void)TLV_add(&send_tlv, (uint8_t)GUI_PARAM_MANUINFOPORT_VID, size,
                      (uint8_t *)&DPM_USER_Settings[PortNum].DPM_ManuInfoPort);
      }
      if (0U != length)
      {
        break;
      }
#endif /* _MANU_INFO */
      default:
        if (0U != length)
        {
          /* At least 1 parameter does not exist */
          TLV_deinit_encode(&send_tlv);
          Send_DpmConfigGetRej(PortNum, pEncodedMsg, GUI_REJ_DPM_INVALID_MESSAGE);
          goto __end;
        }
        break;
    }
    index++;
    /*
    Loop until we haven't processed each specified parameter.
    If there weren't any (length = 0), we exit the loop after one execution.
    */
  } while (index < length);

__end:
  TLV_deinit_encode(&send_tlv);
}

/**
  * @brief   Send DPM_CONFIG_REJ message to GUI with reason of rejection
  * @param   PortNum      Port number
  * @param   pEncodedMsg  Pointer on the encoded message
  * @param   RejectReason Reason of rejection
  * @retval  None
  */
static void Send_DpmConfigGetRej(uint8_t PortNum, uint8_t *pEncodedMsg, USBPD_GUI_Reject_Reason RejectReason)
{
  UNUSED(PortNum);
  TLV_ToSend_Data_t send_tlv;
  (void)TLV_init_encode(&send_tlv, (uint8_t)DPM_CONFIG_REJ, TLV_SIZE_MAX, pEncodedMsg);
  (void)TLV_add(&send_tlv, (uint8_t)RejectReason, 0, NULL);
  TLV_deinit_encode(&send_tlv);
}

/**
  * @brief   Send DPM_MESSAGE_REJ message to GUI with reason of rejection
  * @param   PortNum      Port number
  * @param   pEncodedMsg  Pointer on the encoded message
  * @param   RejectReason Reason of rejection
  * @retval  None
  */
static void Send_DpmMessageRej(uint8_t PortNum, uint8_t *pEncodedMsg, USBPD_GUI_Reject_Reason RejectReason)
{
  UNUSED(PortNum);
  TLV_ToSend_Data_t send_tlv;
  (void)TLV_init_encode(&send_tlv, (uint8_t)DPM_MESSAGE_REJ, TLV_SIZE_MAX, pEncodedMsg);
  (void)TLV_add(&send_tlv, (uint8_t)RejectReason, 0, NULL);
  TLV_deinit_encode(&send_tlv);
}

/**
  * @brief   Send DPM_REGISTER_READ_CNF message to GUI
  * @param   PortNum      Port number
  * @param   pEncodedMsg  Pointer on the encoded message
  * @param   param        Parameter to read
  * @retval  None
  */
static void Send_DpmRegisterReadCnf(uint8_t PortNum, uint8_t *pEncodedMsg, uint8_t param)
{
  TLV_ToSend_Data_t ToSendTLV;
  (void)TLV_init_encode(&ToSendTLV, __GUI_SET_TAG_ID((PortNum + 1), DPM_REGISTER_READ_CNF), TLV_SIZE_MAX, pEncodedMsg);

  uint8_t stateMachineArray[GUI_REG_NUMBER_OF_REGISTERS] =
  {
    (uint8_t)GUI_REG_VENDOR_ID, (uint8_t)GUI_REG_PRODUCT_ID, (uint8_t)GUI_REG_DEVICE_ID,
    (uint8_t)GUI_REG_USBTYPEC_REV, (uint8_t)GUI_REG_USBPD_REV_VER, (uint8_t)GUI_REG_USBPD_INTERFACE_REV,
    (uint8_t)GUI_REG_ALERT, (uint8_t)GUI_REG_ALERT_MASK, (uint8_t)GUI_REG_POWER_STATUS_MASK,
    (uint8_t)GUI_REG_FAULT_STATUS_MASK, (uint8_t)GUI_REG_CONFIG_STANDARD_OUTPUT, (uint8_t)GUI_REG_TCPC_CONTROL,
    (uint8_t)GUI_REG_ROLE_CONTROL, (uint8_t)GUI_REG_FAULT_CONTROL, (uint8_t)GUI_REG_POWER_CONTROL,
    (uint8_t)GUI_REG_CC_STATUS, (uint8_t)GUI_REG_POWER_STATUS, (uint8_t)GUI_REG_FAULT_STATUS,
    (uint8_t)GUI_REG_COMMAND, (uint8_t)GUI_REG_DECIVE_CAP1, (uint8_t)GUI_REG_DECIVE_CAP2,
    (uint8_t)GUI_REG_STD_INPUT_CAP, (uint8_t)GUI_REG_STD_OUTPUT_CAP, (uint8_t)GUI_REG_MSG_HEADER_INFO,
    (uint8_t)GUI_REG_RX_DETECT, (uint8_t)GUI_REG_RX_BYTE_COUNT, (uint8_t)GUI_REG_RX_BUFFER_FRAME_TYPE,
    (uint8_t)GUI_REG_RX_HEADER, (uint8_t)GUI_REG_RX_DATA, (uint8_t)GUI_REG_TRANSMIT, (uint8_t)GUI_REG_TX_BYTE_COUNT,
    (uint8_t)GUI_REG_TX_HEADER, (uint8_t)GUI_REG_TX_DATA, (uint8_t)GUI_REG_VBUS_VOLTAGE,
    (uint8_t)GUI_REG_VBUS_SINK_DISCONNECT_THRESHOLD, (uint8_t)GUI_REG_VBUS_STOP_DISCHARGE_THRESHOLD,
    (uint8_t)GUI_REG_VBUS_VOLTAGE_ALARM_HI_CFG, (uint8_t)GUI_REG_VBUS_VOLTAGE_ALARM_LO_CFG,
    (uint8_t)GUI_REG_VENDOR_DATA
  };
  uint8_t counter = 0;

  /*  If param is not at 0xFF, then it means we only want one parameter.
      We then have to get out of the state machine after the first state */
  if (param != 0xFFU)
  {
    *stateMachineArray = param;
  }

  do
  {
    switch (stateMachineArray[counter])
      /*
        In each case, the register needs to be read. Inclusion in the TLV which
        is going to be sent has to be done with TLV_add().
      */
    {
      case GUI_REG_VENDOR_ID :

        break;
      case GUI_REG_PRODUCT_ID :

        break;
      case GUI_REG_DEVICE_ID :

        break;
      case GUI_REG_USBTYPEC_REV :

        break;
      case GUI_REG_USBPD_REV_VER :

        break;
      case GUI_REG_USBPD_INTERFACE_REV :

        break;
      case GUI_REG_ALERT :

        break;
      case GUI_REG_ALERT_MASK :

        break;
      case GUI_REG_POWER_STATUS_MASK :

        break;
      case GUI_REG_FAULT_STATUS_MASK :

        break;
      case GUI_REG_CONFIG_STANDARD_OUTPUT :

        break;
      case GUI_REG_TCPC_CONTROL :

        break;
      case GUI_REG_ROLE_CONTROL :

        break;
      case GUI_REG_FAULT_CONTROL :

        break;
      case GUI_REG_POWER_CONTROL :

        break;
      case GUI_REG_CC_STATUS :

        break;
      case GUI_REG_POWER_STATUS :

        break;
      case GUI_REG_FAULT_STATUS :

        break;
      case GUI_REG_COMMAND :

        break;
      case GUI_REG_DECIVE_CAP1 :

        break;
      case GUI_REG_DECIVE_CAP2 :

        break;
      case GUI_REG_STD_INPUT_CAP :

        break;
      case GUI_REG_STD_OUTPUT_CAP :

        break;
      case GUI_REG_MSG_HEADER_INFO :

        break;
      case GUI_REG_RX_DETECT :

        break;
      case GUI_REG_RX_BYTE_COUNT :

        break;
      case GUI_REG_RX_BUFFER_FRAME_TYPE :

        break;
      case GUI_REG_RX_HEADER :

        break;
      case GUI_REG_RX_DATA :

        break;
      case GUI_REG_TRANSMIT :

        break;
      case GUI_REG_TX_BYTE_COUNT :

        break;
      case GUI_REG_TX_HEADER :

        break;
      case GUI_REG_TX_DATA :

        break;
      case GUI_REG_VBUS_VOLTAGE :

        break;
      case GUI_REG_VBUS_SINK_DISCONNECT_THRESHOLD :

        break;
      case GUI_REG_VBUS_STOP_DISCHARGE_THRESHOLD :

        break;
      case GUI_REG_VBUS_VOLTAGE_ALARM_HI_CFG :

        break;
      case GUI_REG_VBUS_VOLTAGE_ALARM_LO_CFG :

        break;
      case GUI_REG_VENDOR_DATA :

        break;
      default :
        break;
    }
    counter++;
  } while ((counter < GUI_REG_NUMBER_OF_REGISTERS) && (param != 0xFFU));

  TLV_deinit_encode(&ToSendTLV);
}

static void Send_DpmRegisterWriteCnf(uint8_t PortNum, uint8_t *pEncodedMsg, uint8_t *toProcess)
{
  TLV_Received_Data_t ToProcessTLV;
  (void)TLV_init_decode(&ToProcessTLV, toProcess);

  uint8_t registerName;
  uint16_t registerSize;
  uint8_t *registerValue;

  (void)TLV_get(&ToProcessTLV, &registerName, &registerSize, &registerValue);

