STMicroelectronics/STM32CubeH7RS/Utilities/GUI_INTERFACE/gui_api.c
  switch (registerName)
    /*
      Each case should write the data pointed by registerValue in the appropriate register,
      while taking into account the size of the data with registerSize.
    */
  {
    case GUI_REG_VENDOR_ID :

      break;
    case GUI_REG_PRODUCT_ID :

      break;
    case GUI_REG_DEVICE_ID :

      break;
    case GUI_REG_USBTYPEC_REV :

      break;
    case GUI_REG_USBPD_REV_VER :

      break;
    case GUI_REG_USBPD_INTERFACE_REV :

      break;
    case GUI_REG_ALERT :

      break;
    case GUI_REG_ALERT_MASK :

      break;
    case GUI_REG_POWER_STATUS_MASK :

      break;
    case GUI_REG_FAULT_STATUS_MASK :

      break;
    case GUI_REG_CONFIG_STANDARD_OUTPUT :

      break;
    case GUI_REG_TCPC_CONTROL :

      break;
    case GUI_REG_ROLE_CONTROL :

      break;
    case GUI_REG_FAULT_CONTROL :

      break;
    case GUI_REG_POWER_CONTROL :

      break;
    case GUI_REG_CC_STATUS :

      break;
    case GUI_REG_POWER_STATUS :

      break;
    case GUI_REG_FAULT_STATUS :

      break;
    case GUI_REG_COMMAND :

      break;
    case GUI_REG_DECIVE_CAP1 :

      break;
    case GUI_REG_DECIVE_CAP2 :

      break;
    case GUI_REG_STD_INPUT_CAP :

      break;
    case GUI_REG_STD_OUTPUT_CAP :

      break;
    case GUI_REG_MSG_HEADER_INFO :

      break;
    case GUI_REG_RX_DETECT :

      break;
    case GUI_REG_RX_BYTE_COUNT :

      break;
    case GUI_REG_RX_BUFFER_FRAME_TYPE :

      break;
    case GUI_REG_RX_HEADER :

      break;
    case GUI_REG_RX_DATA :

      break;
    case GUI_REG_TRANSMIT :

      break;
    case GUI_REG_TX_BYTE_COUNT :

      break;
    case GUI_REG_TX_HEADER :

      break;
    case GUI_REG_TX_DATA :

      break;
    case GUI_REG_VBUS_VOLTAGE :

      break;
    case GUI_REG_VBUS_SINK_DISCONNECT_THRESHOLD :

      break;
    case GUI_REG_VBUS_STOP_DISCHARGE_THRESHOLD :

      break;
    case GUI_REG_VBUS_VOLTAGE_ALARM_HI_CFG :

      break;
    case GUI_REG_VBUS_VOLTAGE_ALARM_LO_CFG :

      break;
    case GUI_REG_VENDOR_DATA :

      break;
    default :
      break;
  }
  TLV_deinit_decode(&ToProcessTLV);

  TLV_ToSend_Data_t ToSendTLV;
  /* Generation of the empty response, as it should be done*/
  (void)TLV_init_encode(&ToSendTLV, __GUI_SET_TAG_ID((PortNum + 1), DPM_REGISTER_WRITE_CNF), 12, pEncodedMsg);
  TLV_deinit_encode(&ToSendTLV);
}

/**
  * @brief  Manage Free text sent by the GUI
  * @param  PortNum     The current port number
  * @param  pPayload    Pointer of the text to manage
  * @param  Size        Size of the text
  * @retval USBPD Status
  */
static USBPD_StatusTypeDef Manage_FreeText(uint8_t PortNum, uint8_t *pPayload, uint16_t Size)
{
  USBPD_StatusTypeDef _status = USBPD_FAIL;

  if (NULL != pCB_FreeText)
  {
    pCB_FreeText(PortNum, pPayload, Size);
    _status = USBPD_OK;
  }

  return _status;
}

#if defined(_SNK) || defined(_DRP)
/**
  * @brief  Function to update SNK PDO and power user settings on Port0
  * @retval None
  */
static void UpdateSNKPowerPort0(void)
{
  USBPD_PDO_TypeDef pdo;
  uint32_t _max_power = 0;
  uint16_t _voltage;
  uint16_t _current;
  uint16_t _power;
  uint16_t _min_voltage = 0xFFFF;
  uint16_t _max_voltage = 0;
  uint16_t _max_current = 0;

  for (uint32_t _index = 0; _index < USBPD_NbPDO[0]; _index++)
  {
    pdo.d32 = PORT0_PDO_ListSNK[_index];
    switch (pdo.GenericPDO.PowerObject)
    {
      case USBPD_CORE_PDO_TYPE_FIXED:    /*!< Fixed Supply PDO */
        _voltage = GUI_DECODE_50MV(pdo.SNKFixedPDO.VoltageIn50mVunits);
        GUI_UPDATE_VOLTAGE_MIN(_voltage, _min_voltage);
        GUI_UPDATE_VOLTAGE_MAX(_voltage, _max_voltage);
        _current = GUI_DECODE_10MA(pdo.SNKFixedPDO.OperationalCurrentIn10mAunits);
        GUI_UPDATE_CURRENT_MAX(_current, _max_current);
        break;
      case USBPD_CORE_PDO_TYPE_BATTERY:  /*!< Battery Supply PDO */
        _voltage = GUI_DECODE_50MV(pdo.SNKBatteryPDO.MinVoltageIn50mVunits);
        GUI_UPDATE_VOLTAGE_MIN(_voltage, _min_voltage);
        _voltage = GUI_DECODE_50MV(pdo.SNKBatteryPDO.MaxVoltageIn50mVunits);
        GUI_UPDATE_VOLTAGE_MAX(_voltage, _max_voltage);
        _power = GUI_DECODE_MW(pdo.SNKBatteryPDO.OperationalPowerIn250mWunits);
        GUI_UPDATE_POWER_MAX(_power, _max_power);
        break;
      case USBPD_CORE_PDO_TYPE_VARIABLE: /*!< Variable Supply (non-battery) PDO */
        _voltage = GUI_DECODE_50MV(pdo.SNKVariablePDO.MinVoltageIn50mVunits);
        GUI_UPDATE_VOLTAGE_MIN(_voltage, _min_voltage);
        _voltage = GUI_DECODE_50MV(pdo.SNKVariablePDO.MaxVoltageIn50mVunits);
        GUI_UPDATE_VOLTAGE_MAX(_voltage, _max_voltage);
        _current = GUI_DECODE_10MA(pdo.SNKVariablePDO.OperationalCurrentIn10mAunits);
        GUI_UPDATE_CURRENT_MAX(_current, _max_current);
        break;
#if _PPS
      case USBPD_CORE_PDO_TYPE_APDO:     /*!< Augmented Power Data Object (APDO) */
        _voltage = GUI_DECODE_100MV(pdo.SRCSNKAPDO.MinVoltageIn100mV);
        GUI_UPDATE_VOLTAGE_MIN(_voltage, _min_voltage);
        _voltage = GUI_DECODE_100MV(pdo.SRCSNKAPDO.MaxVoltageIn100mV);
        GUI_UPDATE_VOLTAGE_MAX(_voltage, _max_voltage);
        _current = GUI_DECODE_50MA(pdo.SRCSNKAPDO.MaxCurrentIn50mAunits);
        GUI_UPDATE_CURRENT_MAX(_current, _max_current);
        break;
#endif /* PPS */
      default:
        break;
    }
  }

  GUI_CHECK_VOLTAGE_MIN(_min_voltage,
                        DPM_USER_Settings[USBPD_PORT_0].DPM_SNKRequestedPower.MinOperatingVoltageInmVunits);
  GUI_CHECK_VOLTAGE_MAX(_max_voltage,
                        DPM_USER_Settings[USBPD_PORT_0].DPM_SNKRequestedPower.MaxOperatingVoltageInmVunits);
  GUI_CHECK_CURRENT_MAX(_max_current,
                        DPM_USER_Settings[USBPD_PORT_0].DPM_SNKRequestedPower.MaxOperatingCurrentInmAunits);
  _max_power = ((uint32_t)(_max_voltage) * (uint32_t)(_max_current)) / 1000U;
  GUI_CHECK_POWER_MAX(_max_power, DPM_USER_Settings[USBPD_PORT_0].DPM_SNKRequestedPower.MaxOperatingPowerInmWunits);
}

#if USBPD_PORT_COUNT==2
/**
  * @brief  Function to update SNK PDO and power user settings on Port1
  * @retval None
  */
static void UpdateSNKPowerPort1(void)
{
  USBPD_PDO_TypeDef pdo;
  uint32_t _max_power = 0;
  uint16_t _voltage = 0;
  uint16_t _current = 0;
  uint16_t _power = 0;
  uint16_t _min_voltage = 0xFFFF;
  uint16_t _max_voltage = 0;
  uint16_t _max_current = 0;

  for (uint32_t _index = 0; _index < USBPD_NbPDO[2]; _index++)
  {
    pdo.d32 = PORT1_PDO_ListSNK[_index];
    switch (pdo.GenericPDO.PowerObject)
    {
      case USBPD_CORE_PDO_TYPE_FIXED:    /*!< Fixed Supply PDO */
        _voltage = GUI_DECODE_50MV(pdo.SNKFixedPDO.VoltageIn50mVunits);
        GUI_UPDATE_VOLTAGE_MIN(_voltage, _min_voltage);
        GUI_UPDATE_VOLTAGE_MAX(_voltage, _max_voltage);
        _current = GUI_DECODE_10MA(pdo.SNKFixedPDO.OperationalCurrentIn10mAunits);
        GUI_UPDATE_CURRENT_MAX(_current, _max_current);
        break;
      case USBPD_CORE_PDO_TYPE_BATTERY:  /*!< Battery Supply PDO */
        _voltage = GUI_DECODE_50MV(pdo.SNKBatteryPDO.MinVoltageIn50mVunits);
        GUI_UPDATE_VOLTAGE_MIN(_voltage, _min_voltage);
        _voltage = GUI_DECODE_50MV(pdo.SNKBatteryPDO.MaxVoltageIn50mVunits);
        GUI_UPDATE_VOLTAGE_MAX(_voltage, _max_voltage);
        _power = GUI_DECODE_MW(pdo.SNKBatteryPDO.OperationalPowerIn250mWunits);
        GUI_UPDATE_POWER_MAX(_power, _max_power);
        break;
      case USBPD_CORE_PDO_TYPE_VARIABLE: /*!< Variable Supply (non-battery) PDO */
        _voltage = GUI_DECODE_50MV(pdo.SNKVariablePDO.MinVoltageIn50mVunits);
        GUI_UPDATE_VOLTAGE_MIN(_voltage, _min_voltage);
        _voltage = GUI_DECODE_50MV(pdo.SNKVariablePDO.MaxVoltageIn50mVunits);
        GUI_UPDATE_VOLTAGE_MAX(_voltage, _max_voltage);
        _current = GUI_DECODE_10MA(pdo.SNKVariablePDO.OperationalCurrentIn10mAunits);
        GUI_UPDATE_CURRENT_MAX(_current, _max_current);
        break;
#if _PPS
      case USBPD_CORE_PDO_TYPE_APDO:     /*!< Augmented Power Data Object (APDO) */
        _voltage = GUI_DECODE_100MV(pdo.SRCSNKAPDO.MinVoltageIn100mV);
        GUI_UPDATE_VOLTAGE_MIN(_voltage, _min_voltage);
        _voltage = GUI_DECODE_100MV(pdo.SRCSNKAPDO.MaxVoltageIn100mV);
        GUI_UPDATE_VOLTAGE_MAX(_voltage, _max_voltage);
        _current = GUI_DECODE_50MA(pdo.SRCSNKAPDO.MaxCurrentIn50mAunits);
        GUI_UPDATE_CURRENT_MAX(_current, _max_current);
        break;
#endif /* PPS */
      default:
        break;
    }
  }

  GUI_CHECK_VOLTAGE_MIN(_min_voltage,
                        DPM_USER_Settings[USBPD_PORT_1].DPM_SNKRequestedPower.MinOperatingVoltageInmVunits);
  GUI_CHECK_VOLTAGE_MAX(_max_voltage,
                        DPM_USER_Settings[USBPD_PORT_1].DPM_SNKRequestedPower.MaxOperatingVoltageInmVunits);
  GUI_CHECK_CURRENT_MAX(_max_current,
                        DPM_USER_Settings[USBPD_PORT_1].DPM_SNKRequestedPower.MaxOperatingCurrentInmAunits);
  _max_power = (_max_voltage * _max_current) / 1000;
  GUI_CHECK_POWER_MAX(_max_power, DPM_USER_Settings[USBPD_PORT_1].DPM_SNKRequestedPower.MaxOperatingPowerInmWunits);
}
#endif /* USBPD_PORT_COUNT==2 */
#endif /* _SNK) || _DRP */
/**
  * @}
  */

/**
  * @}
  */
#endif /* _GUI_INTERFACE */

